template/trans.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iib="http://www.sampath.lk/SD/IIBFinacleIntegration/">
   <soapenv:Header/>
   <soapenv:Body>
      <iib:DoTransferRequest>
         <APPCode>SVR</APPCode>
         <Controller>CMN</Controller>
         <CDCICode>V</CDCICode>
         <FromAccountNo>{{.FromAcc}}</FromAccountNo>
         <ToAccountNo>{{.ToAcc}}</ToAccountNo>
         <DTxnAmount>{{.Amount}}</DTxnAmount>
         <DCommAmount>{{.Commission}}</DCommAmount>
         <TransMemo>{{.Memo}}</TransMemo>
         <ValueDate>{{.Date}}</ValueDate>
         <FromCurrCode>LKR</FromCurrCode>
      </iib:DoTransferRequest>
   </soapenv:Body>
</soapenv:Envelope>
